In [250]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [251]:
#index levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]

In [252]:
hier_index = list(zip(outside,inside))

In [253]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [254]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [255]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [256]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [257]:
inside

[1, 2, 3, 1, 2, 3]

In [258]:
df = pd.DataFrame(randn(6,2), hier_index,['A','B'])

In [259]:
df

             A         B
G1 1  1.104562  0.512677
   2  2.336853 -0.732913
   3  0.046646  1.706697
G2 1  0.952369  0.411951
   2 -0.604758  2.298751
   3 -0.184386 -1.203691

In [260]:
#loc and iloc

In [261]:
df.index.names = ['Groups','Num'] #name of index

In [262]:
df.loc['G1','B']  #row and column selecting

Num
1    0.512677
2   -0.732913
3    1.706697
Name: B, dtype: float64

In [263]:
df.loc[['G1','G2']]  #selecting rows

                   A         B
Groups Num
G1     1    1.104562  0.512677
       2    2.336853 -0.732913
       3    0.046646  1.706697
G2     1    0.952369  0.411951
       2   -0.604758  2.298751
       3   -0.184386 -1.203691

In [264]:
df.loc['G2','B'] [2] #finding a particular value fromm the table

2.298751082664397

In [265]:
df.loc['G2'].loc[2]['B']  #finding a particular value fromm the table

2.298751082664397

In [266]:
#cross-section

In [267]:
df

                   A         B
Groups Num
G1     1    1.104562  0.512677
       2    2.336853 -0.732913
       3    0.046646  1.706697
G2     1    0.952369  0.411951
       2   -0.604758  2.298751
       3   -0.184386 -1.203691

In [268]:
df.loc['G1']

            A         B
Num
1    1.104562  0.512677
2    2.336853 -0.732913
3    0.046646  1.706697

In [269]:
df.xs(1,level='Num')

               A         B
Groups
G1      1.104562  0.512677
G2      0.952369  0.411951

In [270]:
#missing data in pandas

In [271]:
#dropping missing values and filling up missing values

In [272]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan], 'C': [1,2,3]}

In [273]:
df= pd.DataFrame(d)

In [274]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [275]:
df.dropna(axis = 1)  #drops any column with a missing value

   C
0  1
1  2
2  3

In [276]:
df.dropna()  #drops any row with a missing value

     A    B  C
0  1.0  5.0  1

In [277]:
df.dropna(thresh=2)  #cuts the one with at least two nan value

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [278]:
df.fillna(value='idiot')  #fills the missinf nan value

       A      B  C
0    1.0    5.0  1
1    2.0  idiot  2
2  idiot  idiot  3

In [279]:
df['A'].fillna(value=df['A'].mean())  #fill the nan with the mean of A

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [280]:
#groupby for pandas: GroupBy is a powerful and versatile function in Python. It allows you to split your data into separate groups to perform computations for better analysis

In [281]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}   #dictionary

In [282]:
df = pd.DataFrame(data) #changed to dataframe

In [283]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [284]:
df.groupby('Company')['Person'].count()

Company
FB      2
GOOG    2
MSFT    2
Name: Person, dtype: int64

In [285]:
df_comp= df.groupby('Company')

In [286]:
df_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [287]:
df_comp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [288]:
df_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [289]:
df_comp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [290]:
df.groupby('Person').min()

        Company  Sales
Person
Amy        MSFT    340
Carl         FB    243
Charlie    GOOG    120
Sam        GOOG    200
Sarah        FB    350
Vanessa    MSFT    124

In [291]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [292]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [293]:
#merging joining and concatenating data frames

In [294]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [295]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [296]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [297]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [298]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [299]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [300]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [301]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [302]:
#dataframe examples

left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [303]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [304]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [305]:
#merging:

In [306]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [307]:
#opearations in pandas

In [308]:
df = pd.DataFrame({'col1':[1,2,3,4],
                  'col2':[444,555,666,444],
                  'col3':['abc','def','ghi','xyz']})
df.head()#you can put the amount of data you want it to return

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [309]:
df.head(2)

   col1  col2 col3
0     1   444  abc
1     2   555  def

In [310]:
#finding unique values in a dataframe

In [311]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [312]:
df['col3'].unique()

array(['abc', 'def', 'ghi', 'xyz'], dtype=object)

In [313]:
len(df['col2'].unique())

3

In [314]:
#value count

In [315]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [316]:
#selective data

In [317]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [318]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [319]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [320]:
def times2(x):
    return x*2

In [321]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [322]:
df['col1']*2

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [323]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [324]:
df['col2']

0    444
1    555
2    666
3    444
Name: col2, dtype: int64

In [325]:
df['col2'].apply(lambda x :x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [326]:
#removing columns

In [327]:
df.drop('col1',axis=1,inplace=True)

In [328]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [329]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [330]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [331]:
df.sort_values('col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [332]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [333]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [334]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [335]:
df['A'].unique()

array(['foo', 'bar'], dtype=object)

In [336]:
#pivot tables

In [337]:
df.pivot_table(values ='D', index=['A','B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [338]:
#data input and output

In [339]:
conda install sqlalchemy

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

# All requested packages already installed.


Note: you may need to restart the kernel to use updated packages.

In [340]:
pwd

'C:\\Users\\PC\\Downloads\\Refactored_Py_DS_ML_Bootcamp-master\\03-Python-for-Data-Analysis-Pandas'

In [341]:
#reading and opening csv file

In [342]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [343]:
df = pd.read_csv('example')

In [344]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [345]:
df.to_csv('My_output',index=False)

In [346]:
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [347]:
#read and write from excel file ...you can only import data but not the formular on an excel sheet

In [352]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [353]:
df.to_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

In [354]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [357]:
#html

In [359]:
table_MN = pd.read_html('https://en.wikipedia.org/wiki/Minnesota')

In [360]:
type(table_MN)

list

In [361]:
table_MN

[                                            Minnesota  \
 0                                               State
 1                                  State of Minnesota
 2   .mw-parser-output .ib-settlement-cols{text-ali...
 3   Nickname(s): Land of 10,000 Lakes;North Star S...
 4   Motto(s): L'Étoile du Nord (French: The Star o...
 5                           Anthem: "Hail! Minnesota"
 6   Map of the United States with Minnesota highli...
 7                                             Country
 8                                    Before statehood
 9                               Admitted to the Union
 10                                            Capital
 11                                       Largest city
 12                      Largest metro and urban areas
 13                                         Government
 14                                         • Governor
 15                              • Lieutenant Governor
 16                                        Legislature
 17                                      • Upper house
 18                                      • Lower house
 19                                          Judiciary
 20                                      U.S. senators
 21                              U.S. House delegation
 22                                               Area
 23                                            • Total
 24                                             • Land
 25                                            • Water
 26                                             • Rank
 27                                         Dimensions
 28                                           • Length
 29                                            • Width
 30                                          Elevation
 31           Highest elevation (Eagle Mountain[1][2])
 32          Lowest elevation (Lake Superior[1][2][3])
 33                                  Population (2021)
 34                                            • Total
 35                                             • Rank
 36                                          • Density
 37                                             • Rank
 38                          • Median household income
 39                                      • Income rank
 40                                         Demonym(s)
 41                                           Language
 42                                • Official language
 43                                  • Spoken language
 44                                          Time zone
 45                                     • Summer (DST)
 46                                  USPS abbreviation
 47                                      ISO 3166 code
 48                           Traditional abbreviation
 49                                           Latitude
 50                                          Longitude
 51                                            Website

                                           Minnesota.1
 0                                               State
 1                                  State of Minnesota
 2   .mw-parser-output .ib-settlement-cols{text-ali...
 3   Nickname(s): Land of 10,000 Lakes;North Star S...
 4   Motto(s): L'Étoile du Nord (French: The Star o...
 5                           Anthem: "Hail! Minnesota"
 6   Map of the United States with Minnesota highli...
 7                                       United States
 8                                 Minnesota Territory
 9              May 11, 1858 (32nd State in the Union)
 10                                         Saint Paul
 11                                        Minneapolis
 12                             Minneapolis–Saint Paul
 13                                         Government
 14                                     Tim Walz (DFL)
 15                               Peggy Flanagan (DFL)
 16                              Minnesota Legislature
 17                                             Senate
 18                           House of Representatives
 19                            Minnesota Supreme Court
 20                Amy Klobuchar (DFL)Tina Smith (DFL)
 21           4 Democrats3 Republicans1 vacancy (list)
 22                                               Area
 23                      86,935.83 sq mi (225,163 km2)
 24                      79,626.74 sq mi (206,232 km2)
 25                  7,309.09 sq mi (18,930 km2) 8.40%
 26                                               12th
 27                                         Dimensions
 28                              about 400 mi (640 km)
 29                            200–350 mi (320–560 km)
 30                                   1,200 ft (370 m)
 31                                   2,301 ft (701 m)
 32                                     602 ft (183 m)
 33                                  Population (2021)
 34                                       5,707,390[4]
 35                                               22nd
 36                              68.9/sq mi (26.6/km2)
 37                                 36th (2020 census)
 38                                         $74,593[5]
 39                                               13th
 40                                         Minnesotan
 41                                           Language
 42                                               None
 43              English 88.9% Spanish Somali Hmong[6]
 44                                UTC−06:00 (Central)
 45                                    UTC−05:00 (CDT)
 46                                                 MN
 47                                              US-MN
 48                                              Minn.
 49                             43° 30′ N to 49° 23′ N
 50                             89° 29′ W to 97° 14′ W
 51                                             mn.gov  ,
                  Minnesota state symbols  \
                          Living insignia
 0                                   Bird
 1                              Butterfly
 2                                   Fish
 3                                 Flower
 4                               Mushroom
 5                                   Tree
 6                     Inanimate insignia
 7                               Beverage
 8                                   Food
 9                               Gemstone
 10                                 Other
 11  Lists of United States state symbols


                                     Living insignia.1
 0                                         Common loon
 1                                             Monarch
 2                                             Walleye
 3                       Pink-and-white lady's slipper
 4                  Common morel (Morchella esculenta)
 5                                      Norway pine[7]
 6                                  Inanimate insignia
 7                                                Milk
 8   Fruit: Honeycrisp appleMuffin: BlueberryMushro...
 9                                 Lake Superior agate
 10                                  Photograph: Grace
 11               Lists of United States state symbols  ,
               Location July (°F) July (°C) January (°F) January (°C)
 0          Minneapolis     83/64     28/18         23/7       −4/−13
 1           Saint Paul     83/63     28/17         23/6       −5/−14
 2            Rochester     82/63     28/17         23/3       −5/−16
 3               Duluth     76/55     24/13         19/1       −7/−17
 4            St. Cloud     81/58     27/14        18/−1       −7/−18
 5              Mankato     86/62     30/16         23/3       −5/−16
 6  International Falls     77/52     25/11        15/−6       −9/−21,
                     Historical population  \
                                    Census
 0                                    1850
 1                                    1860
 2                                    1870
 3                                    1880
 4                                    1890
 5                                    1900
 6                                    1910
 7                                    1920
 8                                    1930
 9                                    1940
 10                                   1950
 11                                   1960
 12                                   1970
 13                                   1980
 14                                   1990
 15                                   2000
 16                                   2010
 17                                   2020
 18                            2021 (est.)
 19  Source: 1910–2020[76]2021 Estimate[4]

                                            \
                                      Pop.
 0                                    6077
 1                                  172023
 2                                  439706
 3                                  780773
 4                                 1310283
 5                                 1751394
 6                                 2075708
 7                                 2387125
 8                                 2563953
 9                                 2792300
 10                                2982483
 11                                3413864
 12                                3804971
 13                                4075970
 14                                4375099
 15                                4919479
 16                                5303925
 17                                5706494
 18                                5707390
 19  Source: 1910–2020[76]2021 Estimate[4]

                                            \
                        Unnamed: 2_level_1
 0                                     NaN
 1                                     NaN
 2                                     NaN
 3                                     NaN
 4                                     NaN
 5                                     NaN
 6                                     NaN
 7                                     NaN
 8                                     NaN
 9                                     NaN
 10                                    NaN
 11                                    NaN
 12                                    NaN
 13                                    NaN
 14                                    NaN
 15                                    NaN
 16                                    NaN
 17                                    NaN
 18                                    NaN
 19  Source: 1910–2020[76]2021 Estimate[4]


                                        %±
 0                                       —
 1                                2,730.7%
 2                                  155.6%
 3                                   77.6%
 4                                   67.8%
 5                                   33.7%
 6                                   18.5%
 7                                   15.0%
 8                                    7.4%
 9                                    8.9%
 10                                   6.8%
 11                                  14.5%
 12                                  11.5%
 13                                   7.1%
 14                                   7.3%
 15                                  12.4%
 16                                   7.8%
 17                                   7.6%
 18                                   0.0%
 19  Source: 1910–2020[76]2021 Estimate[4]  ,
             Race and Ethnicity[80]  Alone  Alone.1  Total  Total.1
 0             White (non-Hispanic)  76.3%      NaN  80.2%      NaN
 1  African American (non-Hispanic)   6.9%      NaN   8.2%      NaN
 2            Hispanic or Latino[a]      —      NaN   6.1%      NaN
 3                            Asian   5.2%      NaN   6.2%      NaN
 4                  Native American   1.0%      NaN   2.3%      NaN
 5                 Pacific Islander  0.05%      NaN   0.1%      NaN
 6                            Other   0.4%      NaN   1.3%      NaN,
                       Affiliation  % of population  % of population.1
 0                       Christian               74                NaN
 1                      Protestant               50                NaN
 2                        Lutheran               26                NaN
 3                       Methodist                3                NaN
 4                     Pentecostal                3                NaN
 5   Historically Black Protestant                2                NaN
 6                Other Protestant               16                NaN
 7                  Roman Catholic               22                NaN
 8                          Mormon                1                NaN
 9                 Other Christian                1                NaN
 10  Other religion or association                5                NaN
 11                        Judaism                1                NaN
 12                          Islam                1                NaN
 13          Other and unspecified                3                NaN
 14                   Unaffiliated               20                NaN
 15          Nothing in particular               13                NaN
 16                       Agnostic                4                NaN
 17                        Atheist                3                NaN,
     Year     Office    GOP    DFL Others
 0   2020  President  45.3%  52.4%   2.3%
 1   2020    Senator  43.5%  48.8%   7.7%
 2   2018   Governor  42.4%  53.9%   3.7%
 3   2018    Senator  36.2%  60.3%   3.4%
 4   2018    Senator  42.4%  53.0%   4.6%
 5   2016  President  44.9%  46.4%   8.6%
 6   2014   Governor  44.5%  50.1%   5.4%
 7   2014    Senator  42.9%  53.2%   3.9%
 8   2012  President  45.1%  52.8%   2.1%
 9   2012    Senator  30.6%  65.3%   4.1%
 10  2010   Governor  43.2%  43.7%  13.1%
 11  2008  President  43.8%  54.1%   2.1%
 12  2008    Senator  42.0%  42.0%  16.0%
 13  2006   Governor  46.7%  45.7%   7.6%
 14  2006    Senator  37.9%  58.1%   4.0%
 15  2004  President  47.6%  51.1%   1.3%
 16  2002   Governor  44.4%  33.5%  22.1%
 17  2002    Senator  49.5%  47.3%   1.0%
 18  2000  President  45.5%  47.9%   6.6%
 19  2000    Senator  43.3%  48.8%   7.9%
 20  1998   Governor  34.3%  28.1%  37.6%
 21  1996  President  35.0%  51.1%  13.9%
 22  1996    Senator  41.3%  50.3%   8.4%
 23  1994   Governor  63.3%  34.1%   2.6%
 24  1994    Senator  49.1%  44.1%   6.8%
 25  1992  President  31.9%  43.5%  24.6%,
                        0                                                  1  \
 0  Preceded byCalifornia  List of U.S. states by date of statehood Admit...

                     2
 0  Succeeded byOregon  ,
        Topics related to MinnesotaLand of 10,000 Lakes  \
 0    .mw-parser-output .navbar{display:inline;font-...
 1    .mw-parser-output .navbar{display:inline;font-...
 2                                 Saint Paul (capital)
 3                                               Topics
 4                                              Society
 ..                                                 ...
 97                                    Federal district
 98                                       Insular areas
 99                                    Outlying islands
 100                                Indian reservations
 101                                             Others

      Topics related to MinnesotaLand of 10,000 Lakes.1  \
 0    .mw-parser-output .navbar{display:inline;font-...
 1    .mw-parser-output .navbar{display:inline;font-...
 2                                 Saint Paul (capital)
 3    Index Outline Biking/Cycling Cities Climate (C...
 4    Culture Crime Demographics Economy Education L...
 ..                                                 ...
 97                                    Washington, D.C.
 98   American Samoa Guam Northern Mariana Islands P...
 99   Baker Island Howland Island Jarvis Island John...
 100                        List of Indian reservations
 101                                    Federal enclave

                                             Unnamed: 2
 0                                                  NaN
 1    .mw-parser-output .navbar{display:inline;font-...
 2                                 Saint Paul (capital)
 3                                    Seal of Minnesota
 4                                    Seal of Minnesota
 ..                                                 ...
 97                                                 NaN
 98                                                 NaN
 99                                                 NaN
 100                                                NaN
 101                                                NaN

 [102 rows x 3 columns],
   .mw-parser-output .navbar{display:inline;font-size:88%;font-weight:normal}.mw-parser-output .navbar-collapse{float:left;text-align:left}.mw-parser-output .navbar-boxtext{word-spacing:0}.mw-parser-output .navbar ul{display:inline-block;white-space:nowrap;line-height:inherit}.mw-parser-output .navbar-brackets::before{margin-right:-0.125em;content:"[ "}.mw-parser-output .navbar-brackets::after{margin-left:-0.125em;content:" ]"}.mw-parser-output .navbar li{word-spacing:-0.125em}.mw-parser-output .navbar a>span,.mw-parser-output .navbar a>abbr{text-decoration:inherit}.mw-parser-output .navbar-mini abbr{font-variant:small-caps;border-bottom:none;text-decoration:none;cursor:inherit}.mw-parser-output .navbar-ct-full{font-size:114%;margin:0 7em}.mw-parser-output .navbar-ct-mini{font-size:114%;margin:0 4em}vte State of Minnesota  \
 0                               Saint Paul (capital)
 1                                             Topics
 2                                            Society
 3                                            Regions
 4                     Largest citiespop. over 25,000
 5                                           Counties
 6                                        Attractions
 7                                          Festivals
 8                                              Other
 9                                   Minnesota portal

   .mw-parser-output .navbar{display:inline;font-size:88%;font-weight:normal}.mw-parser-output .navbar-collapse{float:left;text-align:left}.mw-parser-output .navbar-boxtext{word-spacing:0}.mw-parser-output .navbar ul{display:inline-block;white-space:nowrap;line-height:inherit}.mw-parser-output .navbar-brackets::before{margin-right:-0.125em;content:"[ "}.mw-parser-output .navbar-brackets::after{margin-left:-0.125em;content:" ]"}.mw-parser-output .navbar li{word-spacing:-0.125em}.mw-parser-output .navbar a>span,.mw-parser-output .navbar a>abbr{text-decoration:inherit}.mw-parser-output .navbar-mini abbr{font-variant:small-caps;border-bottom:none;text-decoration:none;cursor:inherit}.mw-parser-output .navbar-ct-full{font-size:114%;margin:0 7em}.mw-parser-output .navbar-ct-mini{font-size:114%;margin:0 4em}vte State of Minnesota.1  \
 0                               Saint Paul (capital)
 1  Index Outline Biking/Cycling Cities Climate (C...
 2  Culture Crime Demographics Economy Education L...
 3  Arrowhead Boundary Waters Buffalo Ridge Centra...
 4  Andover Apple Valley Blaine Bloomington Brookl...
 5  Aitkin Anoka Becker Beltrami Benton Big Stone ...
 6         Festivals State Fair Other Mall of America
 7                                         State Fair
 8                                    Mall of America
 9                                   Minnesota portal


In [365]:
table_MN[0].head(5)

,Minnesota,Minnesota.1
0,State,State
1,State of Minnesota,State of Minnesota
2,.mw-parser-output .ib-settlement-cols{text-ali...,.mw-parser-output .ib-settlement-cols{text-ali...
3,"Nickname(s): Land of 10,000 Lakes;North Star S...","Nickname(s): Land of 10,000 Lakes;North Star S..."
4,Motto(s): L'Étoile du Nord (French: The Star o...,Motto(s): L'Étoile du Nord (French: The Star o...

In [366]:
#from sql

In [367]:
from sqlalchemy import create_engine

In [368]:
engine = create_engine('sqlite:///:memory:')

In [370]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [372]:
df.to_sql('my_table',engine)

4

In [380]:
sqldf = pd.read_sql('my_table',con=engine)

In [381]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15